[[[{},{},{},{},{},{},{},{},{}],{},[]],{"1289f54a-b8a0-41d2-b232-c6ef36ffe8bb":{"id":"1289f54a-b8a0-41d2-b232-c6ef36ffe8bb","index":"Blog","node":{"node":{"id":"seeds","path":"/blog/post/seeds/","content":"<h1 id=\"central-america-to-pioneer-a-regenerative-financial-ecosystem\"><a href=\"#central-america-to-pioneer-a-regenerative-financial-ecosystem\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Central America to Pioneer a Regenerative Financial Ecosystem</h1>\n<p>Integrity.Earth is proud to announce a launch partnership with SEEDS.</p>\n<p>SEEDS is a pioneering a financial ecosystem and conscious digital currency designed to empower humanity &#x26; regenerate ecosystems.</p>\n<p>Integrity.Earth facilitates the convergence of the regenerative society into a co-creative development processes that respects a holistic understanding of our interwoven-ness with life.</p>\n<p>This partnership will catalyze the emergence of bioregional economies of abundance and will be instrumental to the five year plan to Solving\nthe Central American Migration Crisis through Regenerative Development.\nTogether, we will sustain a program of Regenerative Development through community empowerment, focused on restoring essential ecological corridors and addressing the systemic causes of the migration crisis. We are pioneering a whole-system transdisciplinary approach that combines proven frameworks of best practices in ecological restoration in conjunction with meeting the socio-economic needs of communities.</p>\n<p>Central America, with a high potential for regeneration, offers a unique opportunity to effectively address a complex systemic failure that risks driving millions to emigrate from the Northern Triangle (Guatemala, El Salvador and Honduras) and improve the resilience of Costa Rica and Panama through large-scale regenerative development.</p>\n<p>Our pathway to restore ecological balance to the region while safeguarding the long-term livelihoods of communities starts with targeting essential biological corridors over a five-year period, where we intend to build capacity for broad impact, as follows:</p>\n<p>Co-creating regenerative economies with all stakeholders through multidisciplinary solutions that build resilience at the local level.\nEnhancing community building and participation, especially the capacity of youth, through empowerment and education.\nIncubating entrepreneurs, cooperatives, and small enterprises, inclusive to women and youth, establishing value chains for sustainable market opportunities.\nDeveloping regenerative agriculture programs that optimise food production through land-use-planning and the recovery of local agrobiodiversity, linked with local ancestral knowledge.\nDeveloping regenerative tourism models and frameworks.\nFacilitate access to innovation technology for rural communities (i.e. sustainable energy production) allowing for youth to identify with local development\nSafeguarding and recovery of essential biological corridors that sustain biodiversity levels and build resilience to climate change.\nWe are proposing a far-reaching, long-term solution that consolidates existing and emerging efforts in the region working towards systemic integrity. This will open up a pathway for effective replication and scale, allowing all of us to converge around a well-being economy that sustains life.</p>\n<p>We are all stakeholders of this planet. We look forward to co-creating a sustainable planetary culture with you.</p>\n","excerpt":"Integrity.Earth is proud to announce a launch partnership with SEEDS.","title":"Central America to Pioneer a Regenerative Financial Ecosystem","tags":[{"title":"blockchain"},{"title":"regeneration"},{"title":"education"}]}}},"36757d66-03ae-40fc-9a1c-384e3c7fb4e9":{"id":"36757d66-03ae-40fc-9a1c-384e3c7fb4e9","index":"Blog","node":{"node":{"id":"threefold_foundation","path":"/blog/post/threefold_foundation/","content":"<h1 id=\"you-are-unique\"><a href=\"#you-are-unique\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>You are unique</h1>\n<p>During a gathering with some friends, I noticed something that made me think about how important it is what we’re doing.</p>\n<p>One of my friends was complaining about how he couldn’t log in to one of his social media platforms, because all of his passwords are different and he forgot which one he used for this particular platform. Another friend was saying how she tagged her sister on a funny meme, but her sister couldn’t find it on Facebook. Turns out she tagged her on Instagram. And then one of them said something that I keep hearing more and more from people, “Why do we have so many apps, I can’t find anything anymore!”</p>\n<p>We exist so many times online, but why? There is only one me in the real world. Why should there not be only one me online? Why should I have 25 different profiles on 25 different platforms, with 25 different logins, when I am unique?</p>\n<p>That is another dilemma that ThreeFold has a solution for with it's autonomous technology. 3Bot - a digital avatar like no other, that basically handles your entire online life. The focus lies on digital privacy, where only you can access your data, and no one else. The 3Bot has all the functionalities you need to interact and exchange information and value, there will be no need for that many applications on your device anymore. With 3Bot, everything changes.</p>\n<p>The 3Bot is built on the ThreeFold Grid, and has the same values as ThreeFold. Freedom, Equality, and Fairness. It is important that your data is safe, and what can be safer than you being the only one who not only has access to it, but also the only one who owns that data? Your online world should not be that different from your offline world. In your offline world, you are the center of your own life. That is what ThreeFold is doing with the 3Bot, putting you in the center of your online life too.</p>\n<p>One decentralized application, one digital wallet, one login and one you. Because you’re unique.</p>\n<p>More information on www.threefold.io</p>\n","excerpt":"During a gathering with some friends, I noticed something that made me think about how important it is what we’re doing.","title":"You Are Unique","tags":[{"title":"autonomy"},{"title":"equality"},{"title":"human"}]}}},"1e6b7f35-08b3-45ae-95eb-f567bafde01e":{"id":"1e6b7f35-08b3-45ae-95eb-f567bafde01e","index":"Blog","node":{"node":{"id":"threefold_tech","path":"/blog/post/threefold_tech/","content":"<h1 id=\"internet-is-growing-wild\"><a href=\"#internet-is-growing-wild\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Internet is growing wild</h1>\n<h3 id=\"the-internet-is-growing-in-a-way-which-is-not-sustainable-there-has-to-be-an-alternative\"><a href=\"#the-internet-is-growing-in-a-way-which-is-not-sustainable-there-has-to-be-an-alternative\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>The internet is growing in a way which is not sustainable, there has to be an alternative.</h3>\n<h2 id=\"internet-capacity-needs-to-become-localized\"><a href=\"#internet-capacity-needs-to-become-localized\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Internet capacity needs to become localized</h2>\n<p>A big majority of users in the world connect to servers that are not present in their region and as such experience higher costs and low performance.</p>\n<p>According to a study of datacentermap.com 80% of the datacenters of the current Internet service providers are based in the U.S. and Europe. The rest of the world has scarce Internet resources dotted around territories.</p>\n<p>As a consequence most internet users use the Internet based services running on infrastructure which is located far away from their physical location and most likely outside their country borders. This decreases the general end-user experience (latency) but also adds unnecessary costs to transporting the information back and forth. Also, it adds legislation and compliance headaches to enterprises.</p>\n<p>Our mission is to empower and inspire people to recognize abundance by living new experiences one hour at a time.</p>\n<h2 id=\"the-world-needs-a-responsible-internet\"><a href=\"#the-world-needs-a-responsible-internet\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>The world needs a responsible internet</h2>\n<p>On a humanitarian level the opportunities for creativity, learning and development are currently negatively influenced by not having access to a performant and affordable internet services. Since Internet access is a human right, it should protect the status quo between the developed and less developed regions of our world.</p>\n<p>The United Nations have declared access to the internet access to be a human right in 2016. See the UN resolution here.</p>\n<h2 id=\"the-internet-needs-to-perform-better\"><a href=\"#the-internet-needs-to-perform-better\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>The Internet needs to perform better</h2>\n<p>Compute and Storage vendors create poor performing solutions. There have been yearly improvements in hardware following Moore's law. While this has allowed ThreeFold to progress and innovate, it has also led to software developers taking these advances for granted; cutting corners where they can, creating sub-optimal code and allowing software components to be layered on top of each other to achieve certain behavioural functionalities.</p>\n<p>The inefficiencies have now led to a situation where organically grown IT architectures are immensely complex. They use a variety of components from different software and hardware vendors integrated by so called 'integrators'. The overall effort and cost involved to create, operate and maintain such architectures is growing continuously and requiring an ever increasing budget and resourcing to continue.</p>\n<p>If we could go down to the core algorithms and take another look at these, innovate at the heart of technology instead of applying patches and pain killers, we would be able to create a lot more end-user capacity than what systems provide today. Systems will last longer and will not have to be replaced by faster ones. Also, less engineers will be needed to create, operate and maintain these systems. Combined, these elements would present a more stable and reliable platform that can achieve higher levels of uptime.</p>\n<p>Only upsides, right? Well a huge downside of such an approach is that vendors will make less revenue and more importantly less margin as systems will run for longer, be more stable and require less updates.</p>\n<p>But why would vendors innovate at the core of their solution?</p>\n<h2 id=\"currently-the-internet-is-extremely-unsustainable\"><a href=\"#currently-the-internet-is-extremely-unsustainable\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Currently the Internet is extremely unsustainable</h2>\n<p>Did you know that the current Internet is responsible of between 5 and 10% of global energy consumptions? Making it more harmful to our planet than the airline Industry. The good news is that we can achieve 10x more power efficiency by addressing certain areas such as storage.</p>\n<p>ThreeFold believes IT can do a much better job at being more sustainable - in fact ThreeFold believes it can reduce the Internet’s carbon footprint by 10 times compared to other industry standards in IT capacity producing solutions.</p>\n<p>Power consumption is a function of better compute and storage performance that in theory would require more racks and cooling. ThreeFold's architectural approach brought solutions that enables it's Farmers to achieve roughly 3 times the performance per rack (so it uses fewer racks) and the racks require less energy than typical racks in the industry.</p>\n<p>Read more about how ThreeFold achieves sustainability in the following blog: 10x times power savings, is this possible?</p>\n<h2 id=\"internet-capacity-is-expensive\"><a href=\"#internet-capacity-is-expensive\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Internet capacity is expensive</h2>\n<p>The biggest cost in running IT architectures is the human cost.</p>\n<p>Today's complex, built out of ‘band aid and patches’ point solutions, organically grown and badly documented IT infrastructures need an armada of people to keep it ticking. Even though this is an example, one can learn a lot from the trends that are presented:</p>\n<p>On average an IT budget takes 5% of overall revenues\nIT consumes 6.5% of the total number of Full-time equivalent in the company of which 85% are insourced and 15% on payroll. This means that the enterprise doesn't retain internal know-how to operate their IT.\nAbout 50% of IT budgets are spent on Infrastructure ane operations. Similarly, a big part goes to applications. A mere 5% is considered to be internal overhead within the IT department.\nAround 65% of the IT budget is spent on resources and services, around 35% is spent on hardware and software.\nThese figures present industry average numbers and paint a troubling picture that IT is a sizeable part of an overall budget, and that most spending is going to have the right knowledge skills insourced to the organisation to run the core IT architecture it relies on. For any other discipline in any organisation this would present an unacceptable risk to the business and it's continuity - strangely not for IT.</p>\n<h2 id=\"people-are-a-source-of-downtime-more-intelligence-is-needed\"><a href=\"#people-are-a-source-of-downtime-more-intelligence-is-needed\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>People are a source of downtime, more intelligence is needed</h2>\n<p>The biggest source of downtime in computer systems are people.</p>\n<p>Getting people involved in fixing infrastructure problems creates the risk of accidentally causing more system downtime. A very recent example on this hit a large organisation cloud service provider.</p>\n<p>20+ years ago when Internet data centers came into existence next to telecom points of presence (POP), the level of complication in architecting, building and maintaining these infrastructures exploded. From an already reasonable complicated technology setup to transport packets of data around the globe, these information warehouses were created where data was uploaded to, processed and the obtained results sent back to end users on the other side of the globe.</p>\n<p>Managing a datacenter that contains solutions for information transportation, storage and processing is not an easy task and the growth of data volume uploaded, stored and processed has exponentially increased. The number of technologies invented and implemented in regards to the processing and storing of information has also exploded. This resulted in a double exponential growth in complexity to architect, build, operate and maintain these IT systems.</p>\n<p>The time has come that we no longer rely on people to do the right thing in case of emergency - the complexity is overwhelming and the dependency on the availability of that information is huge. Having people to do manual deployments and operational responsibilities do not provide the agility and speed to keep up with the continuous exponential growth of the industry. It is time to take the human element out of IT and let smart and autonomous systems to take over. This will also let people focus on more creative activities.</p>\n<h2 id=\"the-internet-is-growing-fast-with-the-wrong-solutions\"><a href=\"#the-internet-is-growing-fast-with-the-wrong-solutions\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>The Internet is growing fast, with the wrong solutions</h2>\n<p>The current growth of internet needs 4000+ new large scale data centers of computer systems.</p>\n<p>The global data growth will reach more than 40 Zetabytes by 2020 which represents an average yearly growth of 42% starting at 4.5 Zetabytes in 2013*. To host all this data over 4000 new big data centers have to to be built. And to achieve this goal, $ 1 trillion USD investment capital is needed and land totalling the size of the UK would be needed e.g. siemens innovation strategy.</p>\n<p>It is evident that the current solutions are super unsustainable and make no sense. Luckily, ThreeFold and many other start-ups are deploying new solutions.</p>\n","excerpt":"Our mission is to empower and inspire people to recognize abundance by living new experiences one hour at a time.","title":"Internet is growing wild","tags":[{"title":"tech"},{"title":"internet"},{"title":"edge-cloud"}]}}}}]